MicrochipTech/wcm-aws-iot-sdk/microchip/harmony/v1_06/framework/peripheral/pcache/processor/pcache_p32mx695f512h.h
/* Created by plibgen $Revision: 1.31 $ */

#ifndef _PCACHE_P32MX695F512H_H
#define _PCACHE_P32MX695F512H_H

/* Section 1 - Enumerate instances, define constants, VREGs */

#include <xc.h>
#include <stdbool.h>

#include "peripheral/peripheral_common_32bit.h"

/* Default definition used for all API dispatch functions */
#ifndef PLIB_INLINE_API
    #define PLIB_INLINE_API extern inline
#endif

/* Default definition used for all other functions */
#ifndef PLIB_INLINE
    #define PLIB_INLINE extern inline
#endif

typedef enum {

    PCACHE_ID_0 = 0,
    PCACHE_NUMBER_OF_MODULES

} PCACHE_MODULE_ID;

typedef enum {

    PLIB_PCACHE_PREFETCH_DISABLE = 0x00,
    PLIB_PCACHE_PREFETCH_ENABLE_CACHED_REGIONS = 0x01,
    PLIB_PCACHE_PREFETCH_ENABLE_NONCACHED_REGIONS = 0x02,
    PLIB_PCACHE_PREFETCH_ENABLE_ALL = 0x03

} PLIB_PCACHE_PREFETCH_ENABLE;

typedef enum {

    PLIB_PCACHE_DATA_DISABLE = 0x00,
    PLIB_PCACHE_DATA_1LINE = 0x01,
    PLIB_PCACHE_DATA_2LINE = 0x02,
    PLIB_PCACHE_DATA_4LINE = 0x03

} PLIB_PCACHE_DATA_ENABLE;

PLIB_INLINE SFR_TYPE* _PCACHE_WAIT_STATE_VREG(PCACHE_MODULE_ID i)
{
    switch (i) {
        case PCACHE_ID_0 :
            return &CHECON;
        case PCACHE_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _PCACHE_PREFETCH_ENABLE_VREG(PCACHE_MODULE_ID i)
{
    switch (i) {
        case PCACHE_ID_0 :
            return &CHECON;
        case PCACHE_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _PCACHE_DATA_CACHE_ENABLE_VREG(PCACHE_MODULE_ID i)
{
    switch (i) {
        case PCACHE_ID_0 :
            return &CHECON;
        case PCACHE_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _PCACHE_INVALIDATE_ON_PFM_PROGRAM_VREG(PCACHE_MODULE_ID i)
{
    switch (i) {
        case PCACHE_ID_0 :
            return &CHECON;
        case PCACHE_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _PCACHE_CACHE_LINE_INDEX_VREG(PCACHE_MODULE_ID i)
{
    switch (i) {
        case PCACHE_ID_0 :
            return &CHEACC;
        case PCACHE_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _PCACHE_CACHE_LINE_ENABLE_VREG(PCACHE_MODULE_ID i)
{
    switch (i) {
        case PCACHE_ID_0 :
            return &CHEACC;
        case PCACHE_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _PCACHE_CACHE_LINE_TYPE_VREG(PCACHE_MODULE_ID i)
{
    switch (i) {
        case PCACHE_ID_0 :
            return &CHETAG;
        case PCACHE_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _PCACHE_CACHE_LINE_LOCK_VREG(PCACHE_MODULE_ID i)
{
    switch (i) {
        case PCACHE_ID_0 :
            return &CHETAG;
        case PCACHE_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _PCACHE_CACHE_LINE_VALID_VREG(PCACHE_MODULE_ID i)
{
    switch (i) {
        case PCACHE_ID_0 :
            return &CHETAG;
        case PCACHE_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _PCACHE_CACHE_LINE_ADDR_VREG(PCACHE_MODULE_ID i)
{
    switch (i) {
        case PCACHE_ID_0 :
            return &CHETAG;
        case PCACHE_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _PCACHE_CACHE_LINE_FLASH_TYPE_VREG(PCACHE_MODULE_ID i)
{
    switch (i) {
        case PCACHE_ID_0 :
            return &CHETAG;
        case PCACHE_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _PCACHE_CACHE_LINE_MASK_VREG(PCACHE_MODULE_ID i)
{
    switch (i) {
        case PCACHE_ID_0 :
            return &CHEMSK;
        case PCACHE_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _PCACHE_WORD0_VREG(PCACHE_MODULE_ID i)
{
    switch (i) {
        case PCACHE_ID_0 :
            return &CHEW0;
        case PCACHE_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _PCACHE_WORD1_VREG(PCACHE_MODULE_ID i)
{
    switch (i) {
        case PCACHE_ID_0 :
            return &CHEW1;
        case PCACHE_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _PCACHE_WORD2_VREG(PCACHE_MODULE_ID i)
{
    switch (i) {
        case PCACHE_ID_0 :
            return &CHEW2;
        case PCACHE_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _PCACHE_WORD3_VREG(PCACHE_MODULE_ID i)
{
    switch (i) {
        case PCACHE_ID_0 :
            return &CHEW3;
        case PCACHE_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _PCACHE_LEAST_RECENTLY_USED_STATE_VREG(PCACHE_MODULE_ID i)
{
    switch (i) {
        case PCACHE_ID_0 :
            return &CHELRU;
        case PCACHE_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _PCACHE_CACHE_HIT_VREG(PCACHE_MODULE_ID i)
{
    switch (i) {
        case PCACHE_ID_0 :
            return &CHEHIT;
        case PCACHE_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _PCACHE_CACHE_MISS_VREG(PCACHE_MODULE_ID i)
{
    switch (i) {
        case PCACHE_ID_0 :
            return &CHEMIS;
        case PCACHE_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_TYPE* _PCACHE_PREFETCH_ABORT_VREG(PCACHE_MODULE_ID i)
{
    switch (i) {
        case PCACHE_ID_0 :
            return &CHEPFABT;
        case PCACHE_NUMBER_OF_MODULES :
        default :
            return (SFR_TYPE*)-1;
    }
}

PLIB_INLINE SFR_DATA _PCACHE_WAIT_STATE_MASK(PCACHE_MODULE_ID i)
{
    switch (i) {
        case PCACHE_ID_0 :
            return _CHECON_PFMWS_MASK;
        case PCACHE_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _PCACHE_PREFETCH_ENABLE_MASK(PCACHE_MODULE_ID i)
{
    switch (i) {
        case PCACHE_ID_0 :
            return _CHECON_PREFEN_MASK;
        case PCACHE_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

