MicrochipTech/wcm-aws-iot-sdk/microchip/harmony/v1_06/framework/peripheral/pcache/processor/pcache_p32mx695f512h.h
PLIB_INLINE SFR_DATA _PCACHE_CACHE_LINE_ADDR_POS(PCACHE_MODULE_ID i)
{
    switch (i) {
        case PCACHE_ID_0 :
            return _CHETAG_LTAG_POSITION;
        case PCACHE_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _PCACHE_CACHE_LINE_FLASH_TYPE_POS(PCACHE_MODULE_ID i)
{
    switch (i) {
        case PCACHE_ID_0 :
            return _CHETAG_LTAGBOOT_POSITION;
        case PCACHE_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _PCACHE_CACHE_LINE_MASK_POS(PCACHE_MODULE_ID i)
{
    switch (i) {
        case PCACHE_ID_0 :
            return (SFR_DATA)0;
        case PCACHE_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _PCACHE_WORD0_POS(PCACHE_MODULE_ID i)
{
    switch (i) {
        case PCACHE_ID_0 :
            return (SFR_DATA)0;
        case PCACHE_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _PCACHE_WORD1_POS(PCACHE_MODULE_ID i)
{
    switch (i) {
        case PCACHE_ID_0 :
            return (SFR_DATA)0;
        case PCACHE_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _PCACHE_WORD2_POS(PCACHE_MODULE_ID i)
{
    switch (i) {
        case PCACHE_ID_0 :
            return (SFR_DATA)0;
        case PCACHE_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _PCACHE_WORD3_POS(PCACHE_MODULE_ID i)
{
    switch (i) {
        case PCACHE_ID_0 :
            return (SFR_DATA)0;
        case PCACHE_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _PCACHE_LEAST_RECENTLY_USED_STATE_POS(PCACHE_MODULE_ID i)
{
    switch (i) {
        case PCACHE_ID_0 :
            return (SFR_DATA)0;
        case PCACHE_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _PCACHE_CACHE_HIT_POS(PCACHE_MODULE_ID i)
{
    switch (i) {
        case PCACHE_ID_0 :
            return (SFR_DATA)0;
        case PCACHE_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _PCACHE_CACHE_MISS_POS(PCACHE_MODULE_ID i)
{
    switch (i) {
        case PCACHE_ID_0 :
            return (SFR_DATA)0;
        case PCACHE_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _PCACHE_PREFETCH_ABORT_POS(PCACHE_MODULE_ID i)
{
    switch (i) {
        case PCACHE_ID_0 :
            return (SFR_DATA)0;
        case PCACHE_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _PCACHE_WAIT_STATE_LEN(PCACHE_MODULE_ID i)
{
    switch (i) {
        case PCACHE_ID_0 :
            return _CHECON_PFMWS_LENGTH;
        case PCACHE_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _PCACHE_PREFETCH_ENABLE_LEN(PCACHE_MODULE_ID i)
{
    switch (i) {
        case PCACHE_ID_0 :
            return _CHECON_PREFEN_LENGTH;
        case PCACHE_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _PCACHE_DATA_CACHE_ENABLE_LEN(PCACHE_MODULE_ID i)
{
    switch (i) {
        case PCACHE_ID_0 :
            return _CHECON_DCSZ_LENGTH;
        case PCACHE_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _PCACHE_INVALIDATE_ON_PFM_PROGRAM_LEN(PCACHE_MODULE_ID i)
{
    switch (i) {
        case PCACHE_ID_0 :
            return _CHECON_CHECOH_LENGTH;
        case PCACHE_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _PCACHE_CACHE_LINE_INDEX_LEN(PCACHE_MODULE_ID i)
{
    switch (i) {
        case PCACHE_ID_0 :
            return _CHEACC_CHEIDX_LENGTH;
        case PCACHE_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _PCACHE_CACHE_LINE_ENABLE_LEN(PCACHE_MODULE_ID i)
{
    switch (i) {
        case PCACHE_ID_0 :
            return _CHEACC_CHEWEN_LENGTH;
        case PCACHE_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _PCACHE_CACHE_LINE_TYPE_LEN(PCACHE_MODULE_ID i)
{
    switch (i) {
        case PCACHE_ID_0 :
            return _CHETAG_LTYPE_LENGTH;
        case PCACHE_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _PCACHE_CACHE_LINE_LOCK_LEN(PCACHE_MODULE_ID i)
{
    switch (i) {
        case PCACHE_ID_0 :
            return _CHETAG_LLOCK_LENGTH;
        case PCACHE_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _PCACHE_CACHE_LINE_VALID_LEN(PCACHE_MODULE_ID i)
{
    switch (i) {
        case PCACHE_ID_0 :
            return _CHETAG_LVALID_LENGTH;
        case PCACHE_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _PCACHE_CACHE_LINE_ADDR_LEN(PCACHE_MODULE_ID i)
{
    switch (i) {
        case PCACHE_ID_0 :
            return _CHETAG_LTAG_LENGTH;
        case PCACHE_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _PCACHE_CACHE_LINE_FLASH_TYPE_LEN(PCACHE_MODULE_ID i)
{
    switch (i) {
        case PCACHE_ID_0 :
            return _CHETAG_LTAGBOOT_LENGTH;
        case PCACHE_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _PCACHE_CACHE_LINE_MASK_LEN(PCACHE_MODULE_ID i)
{
    switch (i) {
        case PCACHE_ID_0 :
            return (SFR_DATA)sizeof(SFR_DATA);
        case PCACHE_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _PCACHE_WORD0_LEN(PCACHE_MODULE_ID i)
{
    switch (i) {
        case PCACHE_ID_0 :
            return (SFR_DATA)sizeof(SFR_DATA);
        case PCACHE_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

