MicrochipTech/wcm-aws-iot-sdk/microchip/harmony/v1_06/framework/peripheral/pcache/processor/pcache_p32mx695f512h.h
PLIB_INLINE SFR_DATA _PCACHE_WORD1_LEN(PCACHE_MODULE_ID i)
{
    switch (i) {
        case PCACHE_ID_0 :
            return (SFR_DATA)sizeof(SFR_DATA);
        case PCACHE_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _PCACHE_WORD2_LEN(PCACHE_MODULE_ID i)
{
    switch (i) {
        case PCACHE_ID_0 :
            return (SFR_DATA)sizeof(SFR_DATA);
        case PCACHE_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _PCACHE_WORD3_LEN(PCACHE_MODULE_ID i)
{
    switch (i) {
        case PCACHE_ID_0 :
            return (SFR_DATA)sizeof(SFR_DATA);
        case PCACHE_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _PCACHE_LEAST_RECENTLY_USED_STATE_LEN(PCACHE_MODULE_ID i)
{
    switch (i) {
        case PCACHE_ID_0 :
            return (SFR_DATA)sizeof(SFR_DATA);
        case PCACHE_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _PCACHE_CACHE_HIT_LEN(PCACHE_MODULE_ID i)
{
    switch (i) {
        case PCACHE_ID_0 :
            return (SFR_DATA)sizeof(SFR_DATA);
        case PCACHE_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _PCACHE_CACHE_MISS_LEN(PCACHE_MODULE_ID i)
{
    switch (i) {
        case PCACHE_ID_0 :
            return (SFR_DATA)sizeof(SFR_DATA);
        case PCACHE_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _PCACHE_PREFETCH_ABORT_LEN(PCACHE_MODULE_ID i)
{
    switch (i) {
        case PCACHE_ID_0 :
            return (SFR_DATA)sizeof(SFR_DATA);
        case PCACHE_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

/* Section 2 - Feature variant inclusion */

#define PLIB_TEMPLATE PLIB_INLINE
#include "../templates/pcache_WaitState_Default.h"
#include "../templates/pcache_PrefetchEnable_Default.h"
#include "../templates/pcache_DataCacheEnable_Default.h"
#include "../templates/pcache_FlashSECInt_Unsupported.h"
#include "../templates/pcache_FlashDEDStatus_Unsupported.h"
#include "../templates/pcache_FlashSECStatus_Unsupported.h"
#include "../templates/pcache_FlashSECCount_Unsupported.h"
#include "../templates/pcache_InvalidateOnPFMProgram_Default.h"
#include "../templates/pcache_CacheLineSelect_Default.h"
#include "../templates/pcache_CacheLineType_Default.h"
#include "../templates/pcache_CacheLineLock_Default.h"
#include "../templates/pcache_CacheLineValid_Default.h"
#include "../templates/pcache_CacheLineAddr_Default.h"
#include "../templates/pcache_CacheLineFlashType_Default.h"
#include "../templates/pcache_CacheLineMask_Default.h"
#include "../templates/pcache_Word_Default.h"
#include "../templates/pcache_LeastRecentlyUsedState_Default.h"
#include "../templates/pcache_CacheHit_Default.h"
#include "../templates/pcache_CacheMiss_Default.h"
#include "../templates/pcache_PrefetchAbort_Default.h"

/* Section 3 - PLIB dispatch function definitions */

PLIB_INLINE_API bool PLIB_PCACHE_ExistsWaitState(PCACHE_MODULE_ID index)
{
    switch (index) {
        case PCACHE_ID_0 :
            return PCACHE_ExistsWaitState_Default(index);
        case PCACHE_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void PLIB_PCACHE_WaitStateSet(PCACHE_MODULE_ID index, uint32_t clocks)
{
    switch (index) {
        case PCACHE_ID_0 :
            PCACHE_WaitStateSet_Default(index, clocks);
            break;
        case PCACHE_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API uint32_t PLIB_PCACHE_WaitStateGet(PCACHE_MODULE_ID index)
{
    switch (index) {
        case PCACHE_ID_0 :
            return PCACHE_WaitStateGet_Default(index);
        case PCACHE_NUMBER_OF_MODULES :
        default :
            return (uint32_t)0;
    }
}

PLIB_INLINE_API bool PLIB_PCACHE_ExistsPrefetchEnable(PCACHE_MODULE_ID index)
{
    switch (index) {
        case PCACHE_ID_0 :
            return PCACHE_ExistsPrefetchEnable_Default(index);
        case PCACHE_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void PLIB_PCACHE_PrefetchEnableSet(PCACHE_MODULE_ID index, PLIB_PCACHE_PREFETCH_ENABLE region)
{
    switch (index) {
        case PCACHE_ID_0 :
            PCACHE_PrefetchEnableSet_Default(index, region);
            break;
        case PCACHE_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API PLIB_PCACHE_PREFETCH_ENABLE PLIB_PCACHE_PrefetchEnableGet(PCACHE_MODULE_ID index)
{
    switch (index) {
        case PCACHE_ID_0 :
            return PCACHE_PrefetchEnableGet_Default(index);
        case PCACHE_NUMBER_OF_MODULES :
        default :
            return (PLIB_PCACHE_PREFETCH_ENABLE)0;
    }
}

PLIB_INLINE_API bool PLIB_PCACHE_ExistsDataCacheEnable(PCACHE_MODULE_ID index)
{
    switch (index) {
        case PCACHE_ID_0 :
            return PCACHE_ExistsDataCacheEnable_Default(index);
        case PCACHE_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void PLIB_PCACHE_DataCacheEnableSet(PCACHE_MODULE_ID index, PLIB_PCACHE_DATA_ENABLE dcache_en)
{
    switch (index) {
        case PCACHE_ID_0 :
            PCACHE_DataCacheEnableSet_Default(index, dcache_en);
            break;
        case PCACHE_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API PLIB_PCACHE_DATA_ENABLE PLIB_PCACHE_DataCacheEnableGet(PCACHE_MODULE_ID index)
{
    switch (index) {
        case PCACHE_ID_0 :
            return PCACHE_DataCacheEnableGet_Default(index);
        case PCACHE_NUMBER_OF_MODULES :
        default :
            return (PLIB_PCACHE_DATA_ENABLE)0;
    }
}

PLIB_INLINE_API bool PLIB_PCACHE_ExistsFlashSECInt(PCACHE_MODULE_ID index)
{
    switch (index) {
        case PCACHE_ID_0 :
            return PCACHE_ExistsFlashSECInt_Unsupported(index);
        case PCACHE_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void _PLIB_UNSUPPORTED PLIB_PCACHE_FlashSECIntEnable(PCACHE_MODULE_ID index)
{
    switch (index) {
        case PCACHE_ID_0 :
            PCACHE_FlashSECIntEnable_Unsupported(index);
            break;
        case PCACHE_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API void _PLIB_UNSUPPORTED PLIB_PCACHE_FlashSECIntDisable(PCACHE_MODULE_ID index)
{
    switch (index) {
        case PCACHE_ID_0 :
            PCACHE_FlashSECIntDisable_Unsupported(index);
            break;
        case PCACHE_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_PCACHE_ExistsFlashDEDStatus(PCACHE_MODULE_ID index)
{
    switch (index) {
        case PCACHE_ID_0 :
            return PCACHE_ExistsFlashDEDStatus_Unsupported(index);
        case PCACHE_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

